Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/hardware_init.c
  /* TPU Encoder clock inputs (rear wheels) */
  k_pin_enc2_pha = k_rx_pc_2, /**< PC.2 - TCLKA (encoder 2 phase A) */
  k_pin_enc2_phb = k_rx_pa_3, /**< PA.3 - TCLKB (encoder 2 phase B) */
  k_pin_enc3_pha = k_rx_pc_0, /**< PC.0 - TCLKC (encoder 3 phase A) */
  k_pin_enc3_phb = k_rx_pb_3, /**< PB.3 - TCLKD (encoder 3 phase B) */

  /* GPTW PWM outputs (4 motors x 2 pins = PH + EN, all on PORT E) */
  k_pin_motor0_ph = k_rx_pe_5, /**< PE.5 - GTIOC0A (motor 0 phase, pin 106) */
  k_pin_motor0_en = k_rx_pe_2, /**< PE.2 - GTIOC0B (motor 0 enable, pin 109) */
  k_pin_motor1_ph = k_rx_pe_4, /**< PE.4 - GTIOC1A (motor 1 phase, pin 107) */
  k_pin_motor1_en = k_rx_pe_1, /**< PE.1 - GTIOC1B (motor 1 enable, pin 110) */
  k_pin_motor2_ph = k_rx_pe_3, /**< PE.3 - GTIOC2A (motor 2 phase, pin 108) */
  k_pin_motor2_en = k_rx_pe_0, /**< PE.0 - GTIOC2B (motor 2 enable, pin 111) */
  k_pin_motor3_ph = k_rx_pe_7, /**< PE.7 - GTIOC3A (motor 3 phase, pin 101) */
  k_pin_motor3_en = k_rx_pe_6, /**< PE.6 - GTIOC3B (motor 3 enable, pin 102) */

  /* ADC current sense (S12AD0, AN004-AN007) */
  k_pin_adc_an004 = k_rx_p4_4, /**< P4.4 - AN004 (motor 3 current) */
  k_pin_adc_an005 = k_rx_p4_5, /**< P4.5 - AN005 (motor 2 current) */
  k_pin_adc_an006 = k_rx_p4_6, /**< P4.6 - AN006 (motor 1 current) */
  k_pin_adc_an007 = k_rx_p4_7, /**< P4.7 - AN007 (motor 0 current) */
} rx_mpc_pin_t;

/** @brief Number of GPTW motor control pins */
typedef enum : uint8_t {
  k_gptw_pin_count = 8, /**< 4 motors x 2 pins (PH + EN) */
  k_sonar_count    = 4, /**< 4 HC-SR04 ultrasonic sensors */
} gpio_pin_counts_t;

/** @brief GPTW PWM frequency constant */
typedef enum : uint32_t {
  k_gptw_pwm_freq_hz = 20000, /**< 20 kHz PWM frequency */
} gptw_freq_t;

/** @brief GPTW dead-time constant */
typedef enum : uint16_t {
  k_gptw_deadtime_ns = 1000, /**< 1 us dead-time between complementary outputs */
} gptw_deadtime_t;

/** @brief RSPI2 channel number for host SPI */
typedef enum : uint8_t {
  k_host_spi_channel = 2, /**< RSPI2 = host SPI peripheral */
} spi_channel_t;

/** @brief I2C channel assignments */
typedef enum : uint8_t {
  k_i2c_channel_host = 0, /**< RIIC0 = host I2C (RPi5 comms) */
  k_i2c_channel_1    = 1, /**< RIIC1 (reserved) */
} i2c_channel_t;

/** @brief I2C bus frequency constants */
typedef enum : uint32_t {
  k_i2c_host_freq_hz = 400000, /**< 400 kHz fast mode for host */
} i2c_freq_t;

/** @brief Number of motor current ADC channels */
typedef enum : uint8_t {
  k_motor_adc_count = 4, /**< 4 motors = 4 current sense channels */
} adc_count_t;

/** @brief SCKCR3 reset/unconfigured state value (before clock initialization) */
static const uint8_t s_sckcr3_reset_state = 0U;

/**
 * @brief Configure I2C bus pins (RIIC0/RIIC1)
 *
 * @details
 * Configures MPC pin multiplexing for Host I2C (RIIC0) on P1.2/P1.3 and
 * RIIC host I2C on P2.0/P2.1. Sets PSEL registers to enable I2C peripheral
 * function for SCL and SDA pins.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P1.2 configured as SCL0, P1.3 configured as SDA0
 * @post P2.1 configured as SCL1, P2.0 configured as SDA1
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_i2c(void)
{
  static const char* s_tag = "GPIO_I2C";

  /* Host I2C (RIIC0): SCL0 + SDA0 */
  rx_err_t err = rx_mpc_set_riic((rx_port_pin_t)k_pin_host_scl0);
  RX_RETURN_ON_ERROR(err, s_tag, "SCL0 pin config failed");

  err = rx_mpc_set_riic((rx_port_pin_t)k_pin_host_sda0);
  RX_RETURN_ON_ERROR(err, s_tag, "SDA0 pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure host SPI pins (RSPI2)
 *
 * @details
 * Configures MPC pin multiplexing for RSPI2 host SPI interface on PD.1-PD.4.
 * Sets PSEL registers to enable RSPI2 peripheral function for COPI, CIPO,
 * SCLK, and CS0 pins used for RPi5 communication.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post PD.1-PD.4 configured as RSPI2 COPI/CIPO/SCLK/CS0
 * @post RSPI2 pins ready for host communication
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_host_spi(void)
{
  static const char* s_tag = "GPIO_SPI";

  rx_err_t err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_copi);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 COPI pin config failed");

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_cipo);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 CIPO pin config failed");

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_sclk);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 SCLK pin config failed");

  err = rx_mpc_set_rspi((rx_port_pin_t)k_pin_host_cs0);
  RX_RETURN_ON_ERROR(err, s_tag, "RSPI2 CS0 pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure MTU encoder input pins (front wheels)
 *
 * @details
 * Configures MPC pin multiplexing for MTU external clock inputs MTCLKA-MTCLKD
 * on P2.4/P2.5/PA.1/PC.5. Enables pulse counter mode for quadrature encoder
 * inputs from front wheel motors.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P2.4/P2.5 configured as MTCLKA/MTCLKB
 * @post PA.1/PC.5 configured as MTCLKC/MTCLKD
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_mtu_encoders(void)
{
  static const char* s_tag = "GPIO_MTU_ENC";

  rx_err_t err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc0_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKA pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc0_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKB pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc1_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKC pin config failed");

  err = rx_mpc_set_mtu_encoder((rx_port_pin_t)k_pin_enc1_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "MTCLKD pin config failed");

