Locked-Inc/STAR/e2-studio-star-rx72n-firmware/src/hardware_init.c
  return k_rx_ok;
}

/**
 * @brief Configure TPU encoder input pins (rear wheels)
 *
 * @details
 * Configures MPC pin multiplexing for TPU external clock inputs TCLKA-TCLKD
 * on PC.2/PA.3/PC.0/PB.3. Enables pulse counter mode for quadrature encoder
 * inputs from rear wheel motors.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post PC.2/PA.3 configured as TCLKA/TCLKB
 * @post PC.0/PB.3 configured as TCLKC/TCLKD
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_tpu_encoders(void)
{
  static const char* s_tag = "GPIO_TPU_ENC";

  rx_err_t err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc2_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKA pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc2_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKB pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc3_pha);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKC pin config failed");

  err = rx_mpc_set_tpu_encoder((rx_port_pin_t)k_pin_enc3_phb);
  RX_RETURN_ON_ERROR(err, s_tag, "TCLKD pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure GPTW PWM output pins (4 motors)
 *
 * @details
 * Configures MPC pin multiplexing for GPTW0-GPTW3 PWM outputs on PORT E
 * (PE0-PE7). Sets PSEL=0x1E for all 8 pins (4 motors x PH+EN per motor).
 * Enables complementary PWM mode for motor phase and enable control.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post PE5/PE2, PE4/PE1, PE3/PE0, PE7/PE6 configured as GPTW outputs
 * @post All 8 GPTW PWM pins ready for motor control
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_gptw_pwm(void)
{
  static const char* s_tag = "GPIO_GPTW";

  const rx_port_pin_t gptw_pins[] = {(rx_port_pin_t)k_pin_motor0_ph,
                                     (rx_port_pin_t)k_pin_motor0_en,
                                     (rx_port_pin_t)k_pin_motor1_ph,
                                     (rx_port_pin_t)k_pin_motor1_en,
                                     (rx_port_pin_t)k_pin_motor2_ph,
                                     (rx_port_pin_t)k_pin_motor2_en,
                                     (rx_port_pin_t)k_pin_motor3_ph,
                                     (rx_port_pin_t)k_pin_motor3_en};

  for (uint8_t i = 0; i < k_gptw_pin_count; i++) {
    const rx_err_t err = rx_mpc_set_gptw(gptw_pins[i]);
    RX_RETURN_ON_ERROR(err, s_tag, "GPTW pin config failed");
  }

  return k_rx_ok;
}

/**
 * @brief Configure ADC current sense input pins
 *
 * @details
 * Configures MPC pin multiplexing for S12AD0 analog inputs AN004-AN007 on
 * P4.4-P4.7. Disables digital input buffers and sets pins to analog mode for
 * motor current sensing.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P4.4-P4.7 configured as AN004-AN007 analog inputs
 * @post ADC pins ready for current sensing
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_adc(void)
{
  static const char* s_tag = "GPIO_ADC";

  rx_err_t err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an004);
  RX_RETURN_ON_ERROR(err, s_tag, "AN004 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an005);
  RX_RETURN_ON_ERROR(err, s_tag, "AN005 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an006);
  RX_RETURN_ON_ERROR(err, s_tag, "AN006 pin config failed");

  err = rx_mpc_set_adc((rx_port_pin_t)k_pin_adc_an007);
  RX_RETURN_ON_ERROR(err, s_tag, "AN007 pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure USB VBUS detection pin
 *
 * @details
 * Configures MPC pin multiplexing for USB0_VBUS detection on P1.6.
 * Enables USB peripheral to detect host connection via VBUS voltage level.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post P1.6 configured as USB0_VBUS input
 * @post USB VBUS detection enabled
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_usb(void)
{
  static const char* s_tag = "GPIO_USB";

  rx_err_t err = rx_mpc_set_usb_vbus((rx_port_pin_t)k_pin_usb_vbus);
  RX_RETURN_ON_ERROR(err, s_tag, "USB VBUS pin config failed");

  return k_rx_ok;
}

/**
 * @brief Configure HC-SR04 sonar trigger pins (GPIO outputs)
 *
 * @details
 * Configures 4 sonar trigger pins as GPIO outputs with initial LOW state.
 * Pins: PF5, PJ5, PJ3, P33. Used to trigger ultrasonic pulse transmission
 * on HC-SR04 distance sensors.
 *
 * @return rx_err_t Error code
 * @retval k_rx_ok All pins configured successfully
 * @retval k_rx_err_hw_init_failed MPC configuration failed for one or more pins
 *
 * @pre MPC write protection disabled (PWPR.B0WI=0, PWPR.PFSWE=1)
 * @pre Pins not in use by other peripherals
 * @post All 4 sonar trigger pins configured as GPIO outputs
 * @post Trigger pins initialized to LOW (idle state)
 *
 * @note Thread-safe. No shared state modified.
 * @note Called only during system initialization.
 *
 * @since Version 1.0.0
 */
static rx_err_t internal_gpio_init_sonar_triggers(void)
{
  static const char* s_tag = "GPIO_SONAR_TRIG";

  const rx_port_pin_t sonar_trig_pins[k_sonar_count] = {(rx_port_pin_t)k_pin_sonar_trig0,
                                                        (rx_port_pin_t)k_pin_sonar_trig1,
                                                        (rx_port_pin_t)k_pin_sonar_trig2,
                                                        (rx_port_pin_t)k_pin_sonar_trig3};

